Repository: victorhbc/bjj_drills
Catalog: lib/l10n/app_*.arb
Languages: pt

# appDescription
source: BJJ Drills - Brazilian Jiu-Jitsu training companion app
pt: BJJ Drills - Aplicativo de treinamento de Jiu-Jitsu Brasileiro

# welcomeTitle
source: Welcome to BJJ Drills!
pt: Bem-vindo ao BJJ Drills!

# welcomeSubtitle
source: Your Brazilian Jiu-Jitsu training companion
pt: Seu companheiro de treinamento de Jiu-Jitsu Brasileiro

source: Hello World!
pt: Olá Mundo!

# readyToStart
source: Ready to start your BJJ journey?
pt: Pronto para começar sua jornada no BJJ?

source: Get Started
pt: Começar

# welcomeMessage
source: Welcome to BJJ Drills! 🥋
pt: Bem-vindo ao BJJ Drills! 🥋

# checkDrillsList
source: Check out the Drills List tab! 🥋
pt: Confira a aba Lista de Exercícios! 🥋

source: Home
pt: Início

source: Drills List
pt: Lista de Exercícios

source: Fast Training
pt: Treino Rápido

source: Timer Configuration
pt: Configuração do Timer

source: Start Fast Training
pt: Iniciar Treino Rápido

source: Ready to Start Training
pt: Pronto para Iniciar o Treino

# tapStartToBegin
source: Tap Start to begin your BJJ drill session
pt: Toque em Iniciar para começar sua sessão de exercícios de BJJ

# drillsSelected
source: {count} drills selected
pt: {count} exercícios selecionados

source: Drills Done
pt: Exercícios Feitos

source: Next in
pt: Próximo em

source: Remaining
pt: Restantes

source: Start
pt: Iniciar

source: Pause
pt: Pausar

source: Resume
pt: Retomar

source: Stop
pt: Parar

source: Training in progress...
pt: Treino em andamento...

source: Training paused
pt: Treino pausado

source: Interval
pt: Intervalo

source: Order
pt: Ordem

source: Repeat
pt: Repetir

source: Random
pt: Aleatório

source: Sequential
pt: Sequencial

source: Yes
pt: Sim

source: No
pt: Não

source: Training Complete!
pt: Treino Concluído!

# completedDrills
source: You completed {count} drills!
pt: Você completou {count} exercícios!

# completedRounds
source: Completed {rounds} rounds
pt: Completou {rounds} rounds

# greatJob
source: Great job on your BJJ training session! 🥋
pt: Ótimo trabalho na sua sessão de treino de BJJ! 🥋

source: Finish
pt: Finalizar

source: Beginner
pt: Iniciante

source: Intermediate
pt: Intermediário

source: Advanced
pt: Avançado

source: All
pt: Todos

source: Language
pt: Idioma

source: Settings
pt: Configurações

source: BJJ Takedown Drills
pt: Exercícios de Queda do BJJ

source: Filter by Difficulty:
pt: Filtrar por Dificuldade:

# takedownDrillsAvailable
source: {count} takedown drills available
pt: {count} exercícios de queda disponíveis

source: Select Drills for Fast Training
pt: Selecionar Exercícios para Treino Rápido

source: Clear All
pt: Limpar Todos

source: Fast Training Setup
pt: Configuração do Treino Rápido

source: Continue to Timer Setup
pt: Continuar para Configuração do Timer

source: Time Interval
pt: Intervalo de Tempo

# howLongBetweenEachDrill
source: How long between each drill announcement
pt: Quanto tempo entre cada anúncio de exercício

source: Minutes:
pt: Minutos:

source: Seconds:
pt: Segundos:

source: Training Options
pt: Opções de Treino

source: Customize your training experience
pt: Personalize sua experiência de treino

source: Random Order
pt: Ordem Aleatória

source: Announce drills in random order
pt: Anunciar exercícios em ordem aleatória

source: Repeat Drills
pt: Repetir Exercícios

# allowDrillsToBeRepeated
source: Allow drills to be repeated during training
pt: Permitir que exercícios sejam repetidos durante o treino

source: Selected Drills
pt: Exercícios Selecionados

# drillsThatWillBeAnnounced
source: Drills that will be announced during training
pt: Exercícios que serão anunciados durante o treino

# andMoreDrills
source: ... and {count} more drills
pt: ... e mais {count} exercícios

source: Steps:
pt: Passos:

source: Start Drill
pt: Iniciar Exercício

source: Favorite
pt: Favorito

# startingDrill
source: Starting {drillName} drill! 🥋
pt: Iniciando exercício {drillName}! 🥋

source: Drill added to favorites! ⭐
pt: Exercício adicionado aos favoritos! ⭐

source: Total Time
pt: Tempo Total
